/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "0";
"version-sig"	= "EN-070918";

"common-controls-restart"		= "รีสตาร์ท";
"common-controls-shutdown"		= "ปิดเครื่อง";
"common-controls-continue"		= "ดำเนินการต่อ";

"common-tab-apple-title"		= " เกี่ยวกับ ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " การทดสอบฮาร์ดแวร์ ";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " โปรไฟล์ฮาร์ดแวร์ ";	// does look better with spaces at head and tail
"common-version-str"			= "เวอร์ชั่น ";
"common-bundle-str"				= "กลุ่ม ";

"mark-graphics-unknown-str"		= "วิดีโอที่ไม่รู้จัก";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "ติดตั้งแล้ว";
"mark-generic-absent-str"		= "ไม่พบ";
"mark-generic-hasDevice-str"	= "อุปกรณ์ที่เชื่อมต่อ";
"mark-generic-hasNoDevice-str"	= "ไม่มีอุปกรณ์ที่เชื่อมต่อ";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "เฮิรตซ์";
"units-byte-short-str"	= "B";
"units-byte-long-str"	= "ไบต์";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "บิต";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "โวลต์";


"units-hour-str"		= " ชั่วโมง ";
"units-hours-str"		= " ชั่วโมง ";
"units-min-str"			= " นาที ";
"units-mins-str"		= " นาที ";
"units-sec-str"			= " วิ";
"units-secs-str"		= " วิ";

"units-kilo-str"		= "K";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= ", ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ".";
"delim-thousds-str"		= ", ";
"delim-space-str"		= " ";
"delim-pct-str"			= "%";

"notcompat-nosupport-str"		= "Apple Hardware Test ไม่รองรับเครื่องนี้";
"notcompat-ownrisk-str"			= "ดำเนินการต่อที่ความเสี่ยงของคุณเอง [เฉพาะการปล่อยล่วงหน้า]";


"test-head-intro1-text"			= "Apple Hardware Test สามารถดำเนินการการทดสอบฮาร์ดแวร์ของ Macintosh ของคุณ";
"test-head-intro2-text"			= "ในการดำเนินการทดสอบ ให้คลิกที่ปุ่ม “ทดสอบ” หรือกดแป้น “T”";

"test-probe-onto-text"			= "กำลังตรวจสอบฮาร์ดแวร์ของคุณ สิ่งนี้อาจใช้เวลาประมาณหนึ่งนาที...";
"test-probe-outof-text"			= "ตรวจสอบฮาร์ดแวร์เสร็จสิ้น";

"test-controls-launch"			= "ทดสอบ";
"test-controls-interrupt"		= "หยุดการทดสอบ";

"test-choices-title"			= "ทดสอบตัวเลือก";
"test-about-title"				= "เกี่ยวกับการทดสอบและผลลัพธ์";
"test-results-title"			= "ทดสอบผลลัพธ์";

"test-results-notestyet"		= "ไม่สามารถเรียกใช้การทดสอบจนกว่าการตรวจสอบเสร็จสิ้น";
"test-results-nodevfound"		= "ไม่พบอุปกรณ์";
"test-results-notyet"			= "เตรียมพร้อมสำหรับการทดสอบ";
"test-results-quick-ongoing"	= "การทดสอบในการดำเนินการ";
"test-results-extend-ongoing"	= "การทดสอบเพิ่มเติมในระหว่างการดำเนินการ";
"test-results-willstop"			= "การทดสอบจะหยุด";
"test-results-interrupted"		= "การทดสอบไม่เสร็จสิ้น";
"test-results-nofail"			= "ไม่พบปัญหา";
"test-results-error"			= "ข้อผิดพลาดภายในระหว่างทดสอบ";
"test-results-failed"			= "แจ้งเตือน!  Apple Hardware Test ตรวจพบข้อผิดพลาด";

"test-ongoing-short-status"		= "การทดสอบในการดำเนินการ";
"test-ongoing-mlb-status"		= "การทดสอบบอร์ดตรรกะหลัก";
"test-ongoing-memory-status"	= "การทดสอบหน่วยความจำ";
"test-ongoing-storage-status"	= "การทดสอบการจัดเก็บ";
"test-ongoing-video-status"		= "การทดสอบกราฟิก";

"test-ongoing-pass-time-text"	= " ในกำลังทดสอบ...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "ในกำลังทดสอบ...";
"test-ongoing-sess-pass-text"	= "หมายเลขการผ่าน: ";
"test-ongoing-sess-time-text"	= "เวลาการทดสอบทั้งหมด: ";

"test-desc-initial-1-text"	= "Apple Hardware Test เป็นเครื่องมือวินิจฉัยสำหรับการตรวจพบปัญหากับส่วนประกอบฮาร์ดแวร์ของคอมพิวเตอร์ของคุณ";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "การทดสอบที่ดำเนินการจะช่วยตรวจสอบหากคุณมีปัญหาฮาร์ดแวร์หรือปัญหาซอฟต์แวร์";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "หากผลลัพธ์การทดสอบตรวจสอบว่าปัญหาฮาร์ดแวร์ไม่มีอยู่ ให้ปรึกษาการปรับเองและ/หรือการช่วยเหลือ (ระบบ) ที่มาพร้อมกับคอมพิวเตอร์ของคุณสำหรับการแก้ไขปัญหาเพิ่มเติม";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 3 นาทีหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";	/* default */
"test-desc-intro-quick-text2"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 10 ถึง 15 วินาทีหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";
"test-desc-intro-quick-text3"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 2 นาทีหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";
"test-desc-intro-quick-text4"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 4 นาทีหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";

"test-desc-intro-extend-text"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 1 ชั่วโมงหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";	/* default */
"test-desc-intro-extend-text2"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 10 ถึง 15 นาทีหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";
"test-desc-intro-extend-text3"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 30 นาทีหรือมากกว่าโดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";
"test-desc-intro-extend-text4"	= "เวลาโดยประมาณเพื่อทำให้เสร็จสิ้น: 2 ชั่วโมงหรือมากกว่า โดยขึ้นอยู่กับจำนวนของหน่วยความจำที่ติดตั้ง";

"test-desc-option-extend-text"	= "ดำเนินการทดสอบเพิ่มเติม (ใช้เวลามากขึ้น)";
"test-desc-option-loop-text"	= "การวนรอบที่เปิดใช้งาน";

"test-desc-quick-running-1-text"	= "กำลังทดสอบในการดำเนินการ...";
"test-desc-quick-running-2-text"	= "ในการหยุด ให้คลิกปุ่ม “หยุดการทดสอบ”";
"test-desc-quick-running-3-text"	= "หรือ กดแป้น “command” (“Apple”) และแป้น “.” (จุด) ในเวลาเดียวกัน";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "กำลังทดสอบเพิ่มเติมในระหว่างการดำเนินการ...";
"test-desc-extend-running-2-text"	= "ในการหยุด ให้คลิกปุ่ม “หยุดการทดสอบ”";
"test-desc-extend-running-3-text"	= "หรือ กดแป้น “command” (“Apple”) และแป้น “.” (จุด) ในเวลาเดียวกัน";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "แจ้งเตือน!  Apple Hardware Test ตรวจพบข้อผิดพลาด";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "ลำดับแรก สร้างโน้ตของรหัสข้อผิดพลาดในบริเวณผลลัพธ์การทดสอบ";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "สำดับสอง หากมีอุปกรณ์ต่อพ่วงใด ๆ ที่เชื่อมกับคอมพิวเตอร์ โปรดปิดคอมพิวเตอร์ ยกเลิกการเชื่อมต่ออุปกรณ์ต่อพ่วงและเรียกใช้การทดสอบเพิ่มเติมเพื่อตรวจสอบผลลัพธ์";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "ต่อไป หากข้อผิดพลาดยังคงรายงานอยู่ โปรดตรวจทานบริการและส่วนประกอบการรองรับที่มาพร้อมกับคอมพิวเตอร์ของคุณสำหรับขั้นตอนบนการติดต่อ AppleCare สำหรับการช่วยเหลือเพิ่มเติม";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "แจ้งเตือน!  Apple Hardware Test ตรวจพบข้อผิดพลาดที่การเริ่มต้น";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "ลำดับแรก สร้างโน้ตของรหัสข้อผิดพลาดในบริเวณผลลัพธ์การทดสอบ";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "สำดับสอง หากมีอุปกรณ์ต่อพ่วงใด ๆ ที่เชื่อมกับคอมพิวเตอร์ โปรดปิดคอมพิวเตอร์ ยกเลิกการเชื่อมต่ออุปกรณ์ต่อพ่วงและเรียกใช้การทดสอบเพิ่มเติมเพื่อตรวจสอบผลลัพธ์";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "ต่อไป หากข้อผิดพลาดยังคงรายงานอยู่ โปรดตรวจทานบริการและส่วนประกอบการรองรับที่มาพร้อมกับคอมพิวเตอร์ของคุณสำหรับขั้นตอนบนการติดต่อ AppleCare สำหรับการช่วยเหลือเพิ่มเติม";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "ผลิตภัณฑ์";
"prof-prod-group-subtitle"		= "รายละเอียดผลิตภัณฑ์:";
"prof-prod-name-label"			= "ชื่อ Macintosh:";
"prof-prod-model-label"			= "รุ่น Macintosh:";
"prof-prod-cputype-label"		= "ประเภท CPU:";
"prof-prod-cpucount-label"		= "จำนวนของตัวประมวลผล:";
"prof-prod-cpucoretotal-label"	= "จำนวนของแกนทั้งหมด:";
"prof-prod-cpucorecount-label"	= "จำนวนของแก่น:";
"prof-prod-cpuspeed-label"		= "ความเร็ว CPU:";
"prof-prod-cpucache-label"		= "แคช CPU L2 (ต่อตัวประมวลผล):";

"prof-prod-L2cache-label"		= "แคช L2:";
"prof-prod-L2cachecore-label"	= "แคช L2 (ต่อแกน):";
"prof-prod-L3cache-label"		= "แคช L3:";

"prof-prod-cpucache3-label"		= "แคช CPU L3 (ต่อ CPU):";
"prof-prod-mlb-sn-label"		= "ซีเรียล MLB#:";
"prof-processor-tray-sn-label"	= "ซีเรียลของถาดตัวประมวลผล#:";

"prof-graph-group-title"		= "วิดีโอ";
"prof-graph-group-subtitle"		= "รายละเอียดวิดีโอ:";
"prof-graph-chipset-label"		= "กราฟิก:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "ความกว้างของการแสดงผล (พิกเซล):";
"prof-graph-disp-height-label"	= "ความสูงของการแสดงผล (พิกเซล):";

"prof-communi-group-title"		= "การสื่อสาร";
"prof-communi-group-subtitle"	= "รายละเอียดการสื่อสาร:";
"prof-communi-enet-mac-label"	= "ที่อยู่ MAC อีเทอร์เน็ต:";
"prof-communi-fwire-mac-label"	= "ที่อยู่ MAC FireWire:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "ตัวรับสัญญาณ IR:";
"prof-communi-usb1-connect-label"	= "USB พอร์ต 1:";
"prof-communi-usb2-connect-label"	= "USB พอร์ต 2:";
"prof-communi-usb3-connect-label"	= "USB พอร์ต 3:";
"prof-communi-usb4-connect-label"	= "USB พอร์ต 4:";

"prof-memo-group-title"			= "หน่วยความจำ";
"prof-memo-group-subtitle"		= "รายละเอียดหน่วยความจำ:";
"prof-memo-overview-label"		= "ภาพรวม";
"prof-memo-slot-1-label"		= "หน่วยความจำ #1";
"prof-memo-slot-2-label"		= "หน่วยความจำ #2";
"prof-memo-slot-3-label"		= "หน่วยความจำ #3";
"prof-memo-slot-4-label"		= "หน่วยความจำ #4";
"prof-memo-slot-5-label"		= "หน่วยความจำ #5";
"prof-memo-slot-6-label"		= "หน่วยความจำ #6";
"prof-memo-slot-7-label"		= "หน่วยความจำ #7";
"prof-memo-slot-8-label"		= "หน่วยความจำ #8";

"prof-memo-type-str"			= "MLB ที่เชื่อม SDRAM";
"prof-memo--str"				= "ไม่รู้จัก";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-3700";
"prof-memo-pc2-4200-str"		= "PC2-3700";
"prof-memo-pc2-4800-str"		= "PC2-3700";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " เวลาวนรอบ (ns)";
"prof-memo-ct2-str"				= " วนรอบ (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "ย้อนหลัง.";
"prof-memo-paired-str"			= "ที่จับคู่กับ #";
"prof-memo-paired-not-str"		= " ไม่ถูกจับคู่";
"prof-memo-mismatch-label"		= "ไม่ตรงกัน:";
"prof-memo-size-str"			= " ขนาด";
"prof-memo-speed-str"			= " ความเร็ว";
"prof-memo-vendor-str"			= " ผู้จำหน่าย";
"prof-memo-recommend-str"		= "ที่แนะนำ: ";
"prof-memo-post-fail-str"		= "ความล้มเหลวของโพสต์";

"prof-board-group-title"		= "บอร์ดตรรกะ";
"prof-board-brom-vers-label"	= "เวอร์ชัน ROM ของการเริ่มต้นระบบ:";
"prof-board-smc-vers-label"		= "เวอร์ชั่น SMC:";
"prof-board-syst-sn-label"		= "ซีเรียลระบบ #:";
"prof-board-bootdev-label"		= "อุปกรณ์การเริ่มต้นระบบเริ่มต้น:";

"prof-stor-group-title"			= "การจัดเก็บ";
"prof-stor-size-label"			= "ขนาด:";

"prof-powr-group-title"			= "กำลังไฟ";
"prof-powr-group-subtitle"		= "รายละเอียดของกำลังไฟ:";
"prof-powr-src-label"			= "แหล่งที่มาของกำลังไฟ:";
"prof-powr-src-wall-str"		= "อะแดปเตอร์";
"prof-powr-src-batt-str"		= "แบตเตอรี่";
"prof-powr-ac-on-str"			= "ที่เชื่อมต่อ";
"prof-powr-ac-off-str"			= "ไม่ได้เชื่อมต่อ";
"prof-powr-capac-label"			= "ความจุ:";
"prof-powr-volt-label"			= "แรงดันไฟฟ้า:";
"prof-powr-status-label"		= "สถานะ:";

